НаДату = в1;    
 
МенеджерРегистров = РегистрыНакопления;
ОграничениеПоВидуРегистра = Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Остатки;
Для Каждого МенеджерРегистра ИЗ МенеджерРегистров Цикл
    МетаданныеРегистра = Метаданные.НайтиПоТипу(ТипЗнч(МенеджерРегистра));
    
    Если ОграничениеПоВидуРегистра <> Неопределено И МетаданныеРегистра.ВидРегистра <> ОграничениеПоВидуРегистра Тогда
        Продолжить;
    КонецЕсли;
    Если МенеджерРегистра.ПолучитьПериодРассчитанныхИтогов()<НаДату Тогда
        МенеджерРегистра.УстановитьПериодРассчитанныхИтогов(НаДату);
    Иначе
        МенеджерРегистра.ПересчитатьИтоги();
    КонецЕсли;
    
КонецЦикла;


МенеджерРегистров = РегистрыБухгалтерии;
ОграничениеПоВидуРегистра = Неопределено;
Для Каждого МенеджерРегистра ИЗ МенеджерРегистров Цикл
    МетаданныеРегистра = Метаданные.НайтиПоТипу(ТипЗнч(МенеджерРегистра));
    
    Если ОграничениеПоВидуРегистра <> Неопределено И МетаданныеРегистра.ВидРегистра <> ОграничениеПоВидуРегистра Тогда
        Продолжить;
    КонецЕсли;
    Если МенеджерРегистра.ПолучитьПериодРассчитанныхИтогов()<НаДату Тогда
        МенеджерРегистра.УстановитьПериодРассчитанныхИтогов(НаДату);
    Иначе
        МенеджерРегистра.ПересчитатьИтоги();
    КонецЕсли;
    
КонецЦикла;
